package allthings.iot.dos.constant;

/**
 * @author :  luhao
 * @FileName :  ErrorCode
 * @CreateDate :  2018/5/2
 * @Description :
 * @ReviewedBy :
 * @ReviewedOn :
 * @VersionHistory :
 * @ModifiedBy :
 * @ModifiedDate :
 * @Comments :
 * @CopyRight : COPYRIGHT(c) iot.tf56.com All Rights Reserved
 * **********************************IotDeviceTypeDao*********************************************************
 */
public enum ErrorCode {
    /**
     * ================设备类型【-10000 ~ -10099】================
     */
    ERROR_1000(-10000, "保存设备类型失败"),
    ERROR_1001(-10001, "删除设备类型失败"),
    ERROR_1002(-10002, "更新设备类型失败"),
    ERROR_1003(-10003, "查询设备类型失败"),
    ERROR_1004(-10004, "设备类型自增主键不能为空"),
    ERROR_1005(-10005, "设备类型不存在或已删除"),
    ERROR_1006(-10006, "设备类型编码不能为空"),
    ERROR_1007(-10007, "设备类型编码不能超过%d个字"),
    ERROR_1008(-10008, "设备类型名称不能为空"),
    ERROR_1009(-10009, "设备类型名称不能超过%d个字"),
    ERROR_1010(-10010, "设备接入协议不能为空"),
    ERROR_1011(-10011, "所属标签不能为空"),
    ERROR_1012(-10012, "连接服务器IP或者域名不能为空"),
    ERROR_1013(-10013, "连接服务器端口不能为空"),
    ERROR_1014(-10014, "测量因子不能为空"),
    ERROR_1015(-10015, "连接服务器IP或者域名格式不正确"),
    ERROR_1016(-10016, "连接服务器端口不合法【范围为：1-65535】"),
    ERROR_1017(-10017, "设备类型状态不能为空"),
    ERROR_1018(-10018, "设备类型【%s】已被项目绑定，请解绑后再操作"),
    ERROR_1019(-10019, "设备类型编码已存在"),
    ERROR_1020(-10020, "设备类型名称已存在"),
    ERROR_1021(-10021, "简介长度不能超过%d个字"),
    ERROR_1022(-10022, "此项目不存在或没有权限操作"),
    ERROR_1023(-10023, "设备类型下有设备存在，不能删除"),
    ERROR_1024(-10024, "无可用设备类型"),
    ERROR_1025(-10025, "无设备类型【%s】权限或不存在或已停用"),


    /**
     * ================项目【-10100 ~ -10199】================
     */
    ERROR_2000(-10100, "保存项目失败"),
    ERROR_2001(-10101, "删除项目失败"),
    ERROR_2002(-10102, "修改项目失败"),
    ERROR_2003(-10103, "查询项目失败"),
    ERROR_2004(-10104, "项目自增主键不能为空"),
    ERROR_2005(-10105, "项目不存在或已删除"),
    ERROR_2006(-10106, "项目名称不能为空"),
    ERROR_2007(-10107, "项目名称不能超过%d个字"),
    ERROR_2008(-10108, "项目协作者不能有项目创建者或管理员"),
    ERROR_2009(-10109, "所属单位不能超过%d个字"),
    ERROR_2010(-10110, "简介不能超过%d个字"),
    ERROR_2011(-10111, "图片地址不能为空"),
    ERROR_2012(-10112, "项目信息不能为空"),
    ERROR_2013(-10113, "没有权限操作项目【%s】"),
    ERROR_2014(-10114, "获取项目详情失败"),
    ERROR_2015(-10115, "项目未审核通过，无法操作"),
    ERROR_2016(-10116, "项目【%s】已存在设备标签，请解绑后操作"),
    ERROR_2017(-10117, "项目【%s】已存在设备类型，请解绑后操作"),
    ERROR_2018(-10118, "项目【%s】已存在设备，请解绑后操作"),
    ERROR_2019(-10119, "项目名称已存在"),
    ERROR_2020(-10120, "没有权限审核项目"),
    ERROR_2021(-10121, "项目审核失败"),
    ERROR_2022(-10122, "项目【%s】已通过审核，无法删除"),
    ERROR_2023(-10123, "AppSecret不存在"),


    /**
     * ================设备【-10200 ~ -10299】================
     */
    ERROR_3000(-10200, "保存设备失败"),
    ERROR_3001(-10201, "删除设备失败"),
    ERROR_3002(-10202, "修改设备失败"),
    ERROR_3003(-10203, "查询设备失败"),
    ERROR_3004(-10204, "设备自增主键不能为空"),
    ERROR_3005(-10205, "设备不存在或已删除"),
    ERROR_3006(-10206, "更新设备状态失败"),
    ERROR_3007(-10207, "设备编码不能为空"),
    ERROR_3008(-10208, "厂商编码不能为空"),
    ERROR_3009(-10209, "设备类型不能为空"),
    ERROR_3010(-10210, "设备编码已存在"),
    ERROR_3011(-10211, "所属项目不能为空"),
    ERROR_3012(-10212, "设备编码不能超过%d个字"),
    ERROR_3013(-10213, "设备状态不能为空"),

    ERROR_3014(-10214, "业务编码不能超过%d个字"),
    ERROR_3015(-10215, "设备名称不能超过%d个字"),
    ERROR_3016(-10216, "mac地址不能超过%d个字"),
    ERROR_3017(-10217, "固件型号不能超过%d个字"),
    ERROR_3018(-10218, "固件版本号不能超过%d个字"),

    ERROR_3019(-10219, "项目没有绑定设备类型【%s】"),
    ERROR_3020(-10220, "设备编码【%s】已存在"),
    ERROR_3021(-10221, "Excel解析出错，纬度不是数字"),

    ERROR_3030(-10222, "Excel解析出错，未读取到SHEET"),
    ERROR_3031(-10223, "Excel模板格式不正确"),
    ERROR_3032(-10224, "Excel解析出错，内容不正确"),
    ERROR_3033(-10225, "Excel解析出错，经度不是数字"),
    ERROR_3034(-10226, "Excel解析出错，纬度不是数字"),
    ERROR_3035(-10227, "查询设备数量失败"),
    ERROR_3036(-10228, "设备导入失败，请查看错误提示"),
    ERROR_3037(-10229, "备注长度不能超过%d个字"),

    ERROR_3038(-10230, "经纬度不能为空"),
    ERROR_3039(-10231, "实时时间不能为空"),

    ERROR_3040(-10232, "经纬度不能只传一个"),
    ERROR_3041(-10233, "无设备【%s】权限或不存在或已停用"),
    ERROR_3042(-10234, "无可用设备"),
    ERROR_3043(-10234, "设备已经绑定其他项目"),
    ERROR_3044(-10234, "无设备权限或不存在或已停用"),


    /**
     * ================因子【-10300 ~ -10399】================
     */
    ERROR_4000(-10300, "保存因子失败"),
    ERROR_4001(-10301, "删除因子失败"),
    ERROR_4002(-10302, "修改因子失败"),
    ERROR_4003(-10303, "查询因子失败"),
    ERROR_4004(-10304, "因子自增主键不能为空"),
    ERROR_4005(-10305, "因子不存在或已删除"),
    ERROR_4006(-10306, "因子编码不能为空"),
    ERROR_4007(-10307, "因子编码不能超过%d个数字、字母或下划线"),
    ERROR_4008(-10308, "因子名称不能为空"),
    ERROR_4009(-10309, "因子名称不能超过%d个字"),
    ERROR_4010(-10310, "聚合类型不能为空"),
    ERROR_4011(-10311, "因子单位名称不能超过%d个字"),
    ERROR_4012(-10312, "因子单位符号不能超过%d个字"),
    ERROR_4013(-10313, "缺少必传因子:%s"),
    ERROR_4014(-10314, ""),
    ERROR_4015(-10315, ""),
    ERROR_4016(-10316, ""),
    ERROR_4017(-10317, "因子【%s】已被设备类型绑定，请解绑后再操作"),
    ERROR_4018(-10318, "查询点位数量失败"),
    ERROR_4019(-10319, "因子编码已存在"),
    ERROR_4020(-10320, "gpsList不能为空"),


    /**
     * ================非功能【-10400 ~ -10499】================
     */
    ERROR_5000(-10400, "未登录或登录过期"),
    ERROR_5001(-10401, "登录失败"),
    ERROR_5002(-10402, "无权限操作"),
    ERROR_5003(-10403, "调用超过最大次数"),

    ERROR_5020(-10403, "业务服务超时，请稍后再试"),
    ERROR_5021(-10404, "系统异常，请稍后再试"),

    ERROR_5050(-10405, "图片上传失败"),
    ERROR_5051(-10406, "图片太大，不能超过3M"),

    ERROR_5052(-10407, "开始时间结束时间不能为空"),
    ERROR_5053(-10408, "页码和页面大小不能为空"),
    ERROR_5054(-10409, "登陆错误次数超过【%d】次，需要验证"),
    ERROR_5055(-10410, "kaptcha生成错误"),
    ERROR_5056(-10411, "路径不能为空"),
    ERROR_5057(-10412, "管理员不存在"),
    ERROR_5058(-10413, "参数不合法"),
    ERROR_5059(-10414, "资源不存在"),
    ERROR_5060(-10415, "请勿频繁提交数据"),

    /**
     * ================报警/事件【-10500 ~ -10599】================
     */
    ERROR_6000(-10500, "报警信息查询失败"),
    ERROR_6050(-10501, "事件信息查询失败"),

    /**
     * ================协议【-10600 ~ -10699】================
     */
    ERROR_7000(-10600, "保存协议类型失败"),
    ERROR_7001(-10601, "删除协议类型失败"),
    ERROR_7002(-10602, "修改协议类型失败"),
    ERROR_7003(-10603, "查询协议类型失败"),
    ERROR_7004(-10604, "协议类型自增主键不能为空"),
    ERROR_7005(-10605, "协议类型不存在或已删除"),
    ERROR_7006(-10606, "协议类型名称不能为空"),
    ERROR_7007(-10607, "协议类型编码不能为空"),
    ERROR_7008(-10608, "协议类型服务器域名不能为空"),
    ERROR_7009(-10609, "协议类型服务器ip不能为空"),
    ERROR_7010(-10610, "协议类型服务器端口不能为空"),
    ERROR_7011(-10611, "协议类型测试服务器域名不能为空"),
    ERROR_7012(-10612, "协议类型测试服务器ip不能为空"),
    ERROR_7013(-10613, "协议类型测试服务器端口不能为空"),
    ERROR_7014(-10614, "协议类型名称不能超过%d个字"),
    ERROR_7015(-10615, "协议类型编码不能超过%d个字"),
    ERROR_7016(-10616, "协议类型服务器域名不合法"),
    ERROR_7017(-10617, "协议类型服务器ip不合法"),
    ERROR_7018(-10618, "协议类型服务器端口不合法【范围为：1-65535】"),
    ERROR_7019(-10619, "协议类型测试服务器域名不合法"),
    ERROR_7020(-10620, "协议类型测试服务器ip不合法"),
    ERROR_7021(-10621, "协议类型测试服务器端口不合法【范围为：1-65535】"),
    ERROR_7022(-10622, "协议类型描述不能超过%d个字"),
    ERROR_7023(-10623, "协议类型测量因子不能为空"),
    ERROR_7024(-10624, "协议类型【%s】设备类型绑定，请解绑后操作"),
    ERROR_7025(-10624, "协议类型编码不允许修改"),

    /**
     * ================用户【-10700 ~ -10799】================
     */
    ERROR_8000(-10700, "手机号已被注册"),
    ERROR_8001(-10701, "用户名已存在"),
    ERROR_8002(-10702, "用户注册失败"),
    ERROR_8003(-10703, "用户名为空或长度超过【%d】"),
    ERROR_8004(-10704, "密码不能为空"),
    ERROR_8005(-10705, "姓名为空，或长度超过【%d】"),
    ERROR_8006(-10706, "手机号为空，或手机号不正确"),
    ERROR_8007(-10707, "验证码为空"),
    ERROR_8008(-10708, "邮箱地址不正确"),
    ERROR_8009(-10709, "公司名称为空或长度超过【%d】"),
    ERROR_8010(-10710, "修改用户失败"),
    ERROR_8011(-10711, "用户下有项目，无法删除用户"),
    ERROR_8012(-10712, "删除用户失败"),
    ERROR_8013(-10713, "没有权限查看用户列表"),
    ERROR_8014(-10714, "无权限操作项目"),
    ERROR_8015(-10715, "用户不存在或已删除"),
    ERROR_8016(-10716, "登陆密码错误"),
    ERROR_8017(-10717, "两次密码输入不相同"),
    ERROR_8018(-10718, "用户ID不能为空"),
    ERROR_8019(-10719, "修改密码失败"),
    ERROR_8020(-10720, "修改用户状态失败"),
    ERROR_8021(-10721, "短信验证码发送失败"),
    ERROR_8022(-10722, "验证码验证失败"),
    ERROR_8023(-10723, "申请的消息编号不能为空"),
    ERROR_8024(-10724, "新密码不能为空"),
    ERROR_8025(-10725, "登陆验证码错误"),
    ERROR_8026(-10726, "用户已被禁用，无法登录"),
    ERROR_8027(-10727, "用户名或密码错误"),
    ERROR_8028(-10728, "确认密码不能为空"),
    ERROR_8029(-10729, "密码强度不安全"),
    ERROR_8030(-10730, "确认密码强度不安全"),
    ERROR_8031(-10731, "再次确认密码强度不安全"),
    /**
     * ============标签管理【-10800 ~ -10999】=================
     */
    ERROR_9000(-10800, "标签已存在"),
    ERROR_9001(-10801, "标签名称为空或长度大于32"),
    ERROR_9002(-10802, "标签ID不能为空"),
    ERROR_9003(-10803, "标签已存在"),
    ERROR_9004(-10804, "标签已存在"),
    ERROR_9005(-10805, "标签已存在"),
    ERROR_9006(-10806, "标签已存在"),
    /**
     * ============标签管理【-11000 ~ -11999】=================
     */
    ERROR_10000(-10900, "token不能为空"),
    ERROR_10001(-10901, "查询不到该clientId"),
    ERROR_10002(-10902, "client证书错误"),
    ERROR_10003(-10903, "token已过期"),
    ERROR_10004(-10904, "认证失败"),
    ERROR_10005(-10905, "标签已存在"),
    ERROR_10006(-10906, "标签已存在"),

    /**
     * ============设备通道【-12000 ~ -12099】=================
     */
    ERROR_12000(-12000, "通道编码不能为空"),
    ERROR_12001(-12001, "通道名称不能为空"),
    ERROR_12002(-12002, "设备id不能为空"),
    ERROR_12003(-12003, "通道信息不能为空"),
    ERROR_12004(-12004, "通道类型不能为空"),
    ERROR_12005(-12005, "设备通道不存在或不是视频设备"),
    ERROR_12006(-12006, "暂无播放地址"),
    ERROR_12007(-12007, "查询通道视频地址异常"),
    ERROR_12008(-12008, "云台控制指令不正确"),
    ERROR_12009(-12009, "云台控制速度指令不正确"),
    ERROR_12010(-12010, "云台控制异常"),
    ERROR_12011(-12010, "云台控制停止异常"),
    ERROR_12012(-12012, "没有直播地址"),
    ERROR_12013(-12013, "没有回放地址"),

    /**
     * ============设备事件【-12100 ~ -12199】=================
     */
    ERROR_12100(-12100, "查询设备事件列表错误"),
    ERROR_12101(-12101, "查询设备事件详情错误"),
    ERROR_12102(-12102, "保存事件推送地址失败"),
    ERROR_12103(-12103, "查询事件推送地址失败"),
    ERROR_12104(-12104, "更新事件推送地址失败"),


    /**
     * ============服务监控【-13000 ~ -13199】=================
     */
    ERROR_13000(-13000, "保存服务信息失败"),
    ERROR_13001(-13001, "查询服务信息失败"),
    ERROR_13002(-13002, "更新服务信息失败"),
    ERROR_13003(-13003, "该服务已存在"),
    ERROR_13004(-13004, "端口IP重复"),
    ERROR_13005(-13005, "删除服务信息失败"),
    ERROR_13006(-13006, "查询第三方平台信息列表失败"),
    ERROR_13007(-13007, "查询第三方平台信息失败"),
    ERROR_13008(-13008, ""),
    ERROR_13009(-13009, ""),
    ERROR_13010(-13010, ""),
    ERROR_13011(-13011, ""),
    ERROR_13012(-13012, "");

    private int code;
    private String message;

    ErrorCode(int code, String message) {
        this.code = code;
        this.message = message;
    }

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public String getMessage() {
        return message;
    }

    public void setMessage(String message) {
        this.message = message;
    }
}
